docs/blog/Comments.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-05-22 Sun 01:18 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Комментарии в коде</title>
<meta name="generator" content="Org Mode" />
<link id="pagestyle" rel="stylesheet" type="text/css" href="../attachments/org.css"/>
</head>
<body>
<div id="preamble" class="status">
<p class="date">Created: 2022-05-22 Sun 01:18</p>
</div>
<div id="content" class="content">
<h1 class="title">Комментарии в коде</h1>
<div class="abstract" id="orgc14be3a">
<p>
Устаревание комментариев в коде - проблема, для которой, на первый взгляд, не
найти хорошего решения. Попробую накидать свои мысли об этом.
</p>

</div>

<div id="outline-container-org21df9f3" class="outline-2">
<h2 id="org21df9f3">Устаревание комментариев в коде</h2>
<div class="outline-text-2" id="text-org21df9f3">
<p>
Все знают что комментарии в коде это &ldquo;костыль&rdquo;. В одном случае их используют как
`git stash` курильщика. В других - для того чтобы заткнуть дыры в выразительности
кода. А ещё все знают, что комментарии имеют свойство устаревать. И если с
первым случаем можно научиться полльзоваться stash, во втором уже ничего не
поделать, то для третьего просто нет пока ещё решения.
</p>
</div>
<div id="outline-container-org0d6c078" class="outline-3">
<h3 id="org0d6c078">Как устаревают комментарии?</h3>
<div class="outline-text-3" id="text-org0d6c078">
<p>
Обычно история комментария проста и печальна: код написали, открыли ПР. После
втыка на ревью решили раскрыть какую-то неочевидность, добавив комментарий. Потом
через год в этом коде что-то поправили. А в комментарии нет. И так после пары
итераций мы можем получить комментарий, который противоречит коду, который он
должен пояснять.
</p>
</div>
</div>
<div id="outline-container-orgbaf73f1" class="outline-3">
<h3 id="orgbaf73f1">Как заставить разработчика править комментарий?</h3>
<div class="outline-text-3" id="text-orgbaf73f1">
<p>
Можно обязать всех смотреть актуальность комментариев на код-ревью. Многие
ограничиваются этим решением и больше к вопросу не возвращаются. Но я, например,
не могу доверять себе не ревью. Потому что я человек. А значит, я ленив,
ошибаюсь и люблю жать LGTM лишь бы от меня отстали. Специально для таких как я
придумали статический анализ. Машина беспристрастна, не устаёт и всгеда готова
покрасить твой ПР в красный цвет, только дай ей повод.
</p>
</div>
</div>
<div id="outline-container-orgb1871f5" class="outline-3">
<h3 id="orgb1871f5">Анализ комментариев</h3>
<div class="outline-text-3" id="text-orgb1871f5">
<p>
Чтобы приготовить антиутопическую реальность, где люди ублажают машины за лайки на
ПР-ы, нужно придумать, как проверять комментарии на актуальность. Один из
простейших способов - прикрепить к каждому комментарию sha всех строчек кода,
которые находятся в одном блоке с ним. Если что-то в коде поменяется - должен
будет поменяться и комментарий, в который нужно как минимум положить новый sha.
Присыпать проверками на CI и подавать вместе с интеграцией в IDE по вкусу, чтобы
снизить болевые ощущения у потребителей. Вы великолепны!
</p>
</div>
</div>
</div>
<div id="outline-container-orgc1b0dc3" class="outline-2">
<h2 id="orgc1b0dc3">Reverse Github Co-pilot</h2>
<div class="outline-text-2" id="text-orgc1b0dc3">
<p>
Не совсем про устаревание комментариев, но тоже по теме. Давненько мечтаю про
обратный гитхабовскому автокомплит. Хочу чтобы он по коду мог сгенерировать
тупой комментарий типа &ldquo;эта функция выводит строчку Hello с параметром name&rdquo;. Не
то чтобы я не мог прочитать код и понять что он делает. Я и не надеюсь, что он
будет понимать код лучше крепкого миддла.
</p>
</div>
<div id="outline-container-orgcff4020" class="outline-3">
<h3 id="orgcff4020">Проиндексируй мне кодовую базу</h3>
<div class="outline-text-3" id="text-orgcff4020">
<p>
У меня немного другое желание - хочу прогнать этот Reverse Github Co-pilot по
кодовой базе и построить индекс каким-нибудь поисковым движком. Чтобы я мог в
любой момент вбить в строку что-то вроде &ldquo;найди мне функцию, которая считает
у нас ставку по кредиту&rdquo;. И не припоминать, назвал я её <code>calculateCreditRate</code>,
<code>getLoanYearly</code> или ещё как-нибудь.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<a class="telegram-button button" href="https://t.me/izpodshtorki" target="_blank"><i></i><span>Подпишись и обсуждай в Telegram</span></a>
</div>
</body>
</html>
